export default {
  projections: {
    ФактВыполРабE: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      спрПользов: {
        __caption__: 'Пользователь',
        фИО: {
          __caption__: 'Пользователь'
        }
      },
      спрКонтрАг: {
        __caption__: 'Контрагент',
        наименование: {
          __caption__: 'Контрагент'
        }
      },
      спрОбъектСтр: {
        __caption__: 'Объект строительства',
        наименование: {
          __caption__: 'Объект строительства'
        }
      },
      тЧФактВыпР: {
        __caption__: 'Фактическое выполнение работ',
        статЗатр: {
          __caption__: 'Статья затрат'
        },
        спрНомен: {
          __caption__: 'Номенклатура',
          наименование: {
            __caption__: 'Номенклатура'
          }
        },
        спрКонтрАг: {
          __caption__: 'Контрагент',
          наименование: {
            __caption__: 'Контрагент'
          }
        },
        спрВидыРаб: {
          __caption__: 'Виды работ',
          наименование: {
            __caption__: 'Виды работ'
          }
        },
        обРаб: {
          __caption__: 'Объем работы'
        },
        спрТранспСр: {
          __caption__: 'Транспортные средства',
          наименование: {
            __caption__: 'Транспортные средства'
          }
        },
        спрТипТрансСр: {
          __caption__: '',
          наименование: {
            __caption__: 'Типы транспортного средства'
          }
        },
        врПриб: {
          __caption__: 'Время прибытия'
        },
        врУб: {
          __caption__: 'Время убытия'
        },
        клЧасНОб: {
          __caption__: 'Количество часов на объекте'
        },
        кдПрост: {
          __caption__: 'Код простоя'
        },
        колЧасПр: {
          __caption__: 'Количество часов простоя'
        },
        колЧасРаб: {
          __caption__: 'Количество часов работы'
        },
        обГруз: {
          __caption__: 'Объем груза'
        },
        спрЕдИзмер: {
          __caption__: 'Единицы измерения',
          наименование: {
            __caption__: 'Единицы измерения'
          }
        }
      }
    },
    ФактВыполРабL: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      спрПользов: {
        __caption__: 'Пользователь',
        фИО: {
          __caption__: 'Пользователь'
        }
      },
      спрКонтрАг: {
        __caption__: 'Контрагент',
        наименование: {
          __caption__: 'Контрагент'
        }
      },
      спрОбъектСтр: {
        __caption__: 'Объект строительства',
        наименование: {
          __caption__: 'Объект строительства'
        }
      }
    }
  },
  validations: {
    время: {
      __caption__: 'Время'
    },
    дата: {
      __caption__: 'Дата'
    },
    номер: {
      __caption__: 'Номер'
    },
    спрКонтрАг: {
      __caption__: 'Контрагент'
    },
    спрОбъектСтр: {
      __caption__: 'Объект строительства'
    },
    спрПользов: {
      __caption__: 'Пользователь'
    },
    тЧФактВыпР: {
      __caption__: 'Фактическое выполнение работ'
    }
  }
};
